openFOAM_3/mach-3-tunnel-with-step/TempRC10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       560;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       580;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          20;
        startFace       590;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          10;
        startFace       610;
    }
    step
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       620;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          600;
        startFace       640;
    }
)

// ************************************************************************* //
